ZigEmbeddedGroup/microzig/port/wch/ch32v/src/chips/ch32v103.svd
			<register>
				<name>R8_UEP2_CTRL__R8_UH_RX_CTRL</name>
				<description>endpoint 2 control;host receiver endpoint control</description>
				<addressOffset>0x2A</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<fields>
					<field>
						<name>MASK_UEP_T_RES</name>
						<description>bit mask of handshake response type for USB endpoint X transmittal (IN)</description>
						<bitRange>[1:0]</bitRange>
					</field>
					<field>
						<name>MASK_UEP_R_RES</name>
						<description>bit mask of handshake response type for USB endpoint X receiving (OUT)</description>
						<bitRange>[3:2]</bitRange>
					</field>
					<field>
						<name>RB_UEP_AUTO_TOG__RB_UH_R_AUTO_TOG</name>
						<description>enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle;enable automatic toggle after successful transfer completion: 0=manual toggle, 1=automatic toggle</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RB_UEP_T_TOG</name>
						<description>prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_UEP_R_TOG__RB_UH_R_TOG</name>
						<description>expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1;expected data toggle flag of host receiving (IN): 0=DATA0, 1=DATA1</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R8_UEP3_T_LEN__R8_UH_TX_LEN</name>
				<description>endpoint 3 transmittal length;host transmittal endpoint transmittal length</description>
				<addressOffset>0x2C</addressOffset>
				<size>8</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R8_UEP3_CTRL__R8_UH_TX_CTRL</name>
				<description>endpoint 3 control;host transmittal endpoint control</description>
				<addressOffset>0x2E</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<fields>
					<field>
						<name>MASK_UEP_T_RES</name>
						<description>bit mask of handshake response type for USB endpoint X transmittal (IN)</description>
						<bitRange>[1:0]</bitRange>
					</field>
					<field>
						<name>MASK_UEP_R_RES</name>
						<description>bit mask of handshake response type for USB endpoint X receiving (OUT)</description>
						<bitRange>[3:2]</bitRange>
					</field>
					<field>
						<name>RB_UEP_AUTO_TOG</name>
						<description>enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RB_UEP_T_TOG</name>
						<description>prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_UEP_R_TOG</name>
						<description>expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R8_UEP4_T_LEN</name>
				<description>endpoint 4 transmittal length</description>
				<addressOffset>0x30</addressOffset>
				<size>8</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R8_UEP4_CTRL</name>
				<description>endpoint 4 control</description>
				<addressOffset>0x32</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<fields>
					<field>
						<name>MASK_UEP_T_RES</name>
						<description>bit mask of handshake response type for USB endpoint X transmittal (IN)</description>
						<bitRange>[1:0]</bitRange>
					</field>
					<field>
						<name>MASK_UEP_R_RES</name>
						<description>bit mask of handshake response type for USB endpoint X receiving (OUT)</description>
						<bitRange>[3:2]</bitRange>
					</field>
					<field>
						<name>RB_UEP_AUTO_TOG</name>
						<description>enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RB_UEP_T_TOG</name>
						<description>prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_UEP_R_TOG</name>
						<description>expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R8_USB_TYPE_C_CTRL</name>
				<description>USB type-C control</description>
				<addressOffset>0x38</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<fields>
					<field>
						<name>RB_UCC1_PU_EN</name>
						<description>USB CC1 pullup resistance control</description>
						<bitRange>[1:0]</bitRange>
					</field>
					<field>
						<name>RB_UCC1_PD_EN</name>
						<description>USB CC1 5.1K pulldown resistance: 0=disable, 1=enable pulldown</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RB_VBUS_PD_EN</name>
						<description>USB VBUS 10K pulldown resistance: 0=disable, 1=enable pullup</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RB_UCC2_PU_EN</name>
						<description>USB CC2 pullup resistance control</description>
						<bitRange>[5:4]</bitRange>
					</field>
					<field>
						<name>RB_UCC2_PD_EN</name>
						<description>USB CC2 5.1K pulldown resistance: 0=disable, 1=enable pulldown</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_UTCC_GP_BIT</name>
						<description>USB general purpose bit</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
		</registers>
	</peripheral>
   <peripheral>
      <name>CRC</name>
      <description>CRC calculation unit</description>
      <groupName>CRC</groupName>
      <baseAddress>0x40023000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DATAR</name>
          <displayName>DATAR</displayName>
          <description>Data register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IDATAR</name>
          <displayName>IDATAR</displayName>
          <description>Independent Data register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IDATA</name>
              <description>Independent Data register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTLR</name>
          <displayName>CTLR</displayName>
          <description>Control register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RST</name>
              <description>Reset bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
